; domain
(define 
    (domain blocksDomain)
    ; Predicates (defines what arguments they have)
    (:predicates
        (INSTRUCTION ?x)
        (BLOCK ?x)
        (complete ?x)
        (clear ?x)
        (on ?x,?y)
    )
    ; Action with preconditions (used to determine edges from state in graph search)
    (:action move
        :parameters (?block ?underObject ?newUnderObject)
        :precondition (and
            (BLOCK ?block) 
            (on ?block ?underObject)
            (clear ?block)
            (clear ?newUnderObject))
        :effect (and (on ?block ?newUnderObject)
            (clear ?underObject)
            (not (on ?block ?underObject))
            (not (clear ?newUnderObject)))
    )
)

; problem
; To solve with fast downward
; ./fast-downward.py blocksDomain.pddl blocksProblem.pddl --search "astar(lmcut())"

(define (problem blocksProblem)
   (:domain blocksDomain)
   ;PDDL code for objects
   ; All objects are initially equal until a predicate "type" is assigned to them
   (:objects
    locA
    locB
    locC
    blockA
    blockB
    blockC
   )
   ; PDDL code for initial state
   ; Asserting predicates that hold true initially in this world
   (:init
   ; Which blocks are on top of blocks
    (on blockC locA)
    (on blockB blockC)
    (on blockA blockB)

    ; Assigning type BLOCK to objects
    (BLOCK blockA)
    (BLOCK blockB)
    (BLOCK blockC)
    (clear blockA)
    (clear locB)
    (clear locC)
   ) 
        
   ;Specifying goal of system
   (:goal (and 
    (on blockC locC)
    (on blockB blockC)
    (on blockA blockB)
   ))
)

; plan
1. (move blocka blockb locb)
   deleted: (on blocka blockb) (clear locb)
   added: (on blocka locb) (clear blockb)
   goals met: 1 of 3
2. (move blockb blockc blocka)
   deleted: (on blockb blockc) (clear blocka)
   added: (on blockb blocka) (clear blockc)
   goals met: 0 of 3
3. (move blockc loca locc)
   deleted: (on blockc loca) (clear locc)
   added: (on blockc locc) (clear loca)
   goals met: 1 of 3
4. (move blockb blocka blockc)
   deleted: (on blockb blocka) (clear blockc)
   added: (on blockb blockc) (clear blocka)
   goals met: 2 of 3
5. (move blocka locb blockb)
   deleted: (on blocka locb) (clear blockb)
   added: (on blocka blockb) (clear locb)
   goals met: 3 of 3
